Tekla Open API Reference for Tekla Structures 2025
Hideable Properties
The Hideable type exposes the following members.
Properties
Name | Description
IsHidden
 Retrieves the information if this object is hidden or not.
Top
See Also
Reference
Hideable Class
Tekla.Structures.Drawing Namespace